GHP-63-ECE/ARCS/ARCS-ESP32/src/drive.cpp
#include <Arduino.h>
#include <BluetoothSerial.h>
#include <ESP32Servo.h> // ONLY LIBRARY NECESARY FOR ESC 
#include <Wire.h>
#include <SPI.h>
#include <Adafruit_MPU6050.h>

#include <PID.h>

BluetoothSerial BS;

Adafruit_MPU6050 imu;

float gyroX = 0;
float gyroY = 0;
float gyroZ = 0;

float accelX;
float accelY;
float accelZ;

double gyroX_offset = 0, gyroY_offset = 0, gyroZ_offset = 0;
double accelX_offset = 0, accelY_offset = 0, accelZ_offset = 0;
double raw_ax, raw_ay, raw_az;
double raw_gx, raw_gy, raw_gz;
double gyroX_offset_rad, gyroY_offset_rad, gyroZ_offset_rad;

const int numSamples = 2000; // Number of readings to average

//#include <HardwareSerial.h>
PID pidController = PID();
PID velPIDController = PID();

const double kP = 0;
const double kI = 0;
const double kD = 0;

const double kP_vel = 0.1;
const double kI_vel = 0;
const double kD_vel = 0;
// Function prototypes because c++ is a liar
void stopAllMotors();
void directionForward();
void directionBackward();
void setPower(int speedA, int speedB);
void updateEncoderLeft();
void updateEncoderRight();
void driveDistance(float distance, int speed);
void forwards();
void backwards();
void left();
void right();
void setPowerLeft(int left);
void setPowerRight(int right);
int getEncoderSpeedLeft();
int getEncoderSpeedRight();
void setSpeedRight(int speed);
void setSpeedLeft(int speed);

//Raspberry Pi communication Pin Definitions
//#define RXD2 16  // GPIO16 as RX
//#define TXD2 17  // GPIO17 as TX

//HardwareSerial mySerial(2); // Use Serial2
 
// Motor Pins
// Left
const int PWML = 23;
const int L1 = 22;
const int L2 = 21;

// Right
const int PWMR = 19;
const int R1 = 18;
const int R2 = 5;

int targetPositionRight;
int targetPositionLeft;

byte servoPin = 13; // signal pin for the ESC.
Servo servo;

// Encoder Connections
const int ENCAFL = 35; // Encoder A pin for Front Left Motor
const int ENCBFL = 34; // Encoder B pin for Front Left Motor

const int ENCAFR = 33; // Encoder A pin for Front Right Motor
const int ENCBFR = 32; // Encoder B pin for Front Right Motor

volatile long encoderValueLeft = 0;
volatile long encoderValueRight = 0;

int powerValue = 1100;

const float wheelDiameter = 44.0; // mm
const long ticksPerRotation = 7*298; 
const float wheelCircumference = wheelDiameter * PI;
const float trackWidth = 150.0; // mm - TODO
const float movementSpeed = 128.0; // Speed for driving forward/backward (0-255)
const float rpmAtMaxSpeed = 100; // Maximum RPM of the motor at full speed - TODO
const float turnSpeed = 128.0; // Speed for turning left/right (0-255) - TODO

const float cameraFOVWidthMM = 100.0; // Width of the camera's field of view in millimeters - TODO
const float cameraFOVHeightMM = 75.0; // Height of the camera's field of view in millimeters - TODO

int previousEncoderPosLeft = 0;
int previousEncoderPosRight = 0;

int leftPower;
int rightPower;


// MARK: Movement Calculations

float RPM(float speed) {
  return rpmAtMaxSpeed * (speed / 255.0);
}

float mmPerSecond(float speed) {
  return (RPM(speed) * wheelCircumference) / 60;
}

float degreesPerSecond(float speed) {
  return (2 * mmPerSecond(speed) / trackWidth) * 180 / PI;
}

void driveDistanceWithoutEncoders(float distance, int speed) {
  float timeToDrive = distance / mmPerSecond(speed);
  timeToDrive = abs(timeToDrive); // Ensure time is positive
  setPower(speed, speed);
  delay(timeToDrive * 1000);
  stopAllMotors();
}

void rotateDegreesWithoutEncoders(float degrees, int speed) {
  float timeToRotate = degrees / degreesPerSecond(speed);
  timeToRotate = abs(timeToRotate); // Ensure time is positive
  if (degrees > 0) {
    setPower(speed, -speed); // Turn right
  } else {
    setPower(-speed, speed); // Turn left
  }
  delay(timeToRotate * 1000);
  stopAllMotors();
}

// Calculating distance to the center of a crack based on normalized coordinates (cx, cy) of the crack in the camera's field of view
float distanceToCrackCenter(float cx, float cy) {
  // Convert normalized pixel coordinates to millimeters
  float x_mm = (cx - 0.5) * cameraFOVWidthMM;
  float y_mm = (cy - 0.5) * cameraFOVHeightMM;

  // Calculate distance to the center of the crack using Pythagorean theorem
  return sqrt(x_mm * x_mm + y_mm * y_mm);
}

float angleToCrackCenter(float cx, float cy) {
  // Convert normalized pixel coordinates to millimeters
  float x_mm = (cx - 0.5) * cameraFOVWidthMM;
  float y_mm = (cy - 0.5) * cameraFOVHeightMM;

  // Calculate angle to the center of the crack using arctangent
  return atan2(x_mm, -y_mm) * (180 / PI); // atan2 is flipped so that 0 degrees is forward and positive angles are to the right
}

// Drives to the crack's center such that the crack is centered in the camera's field of view at (0.5, 0.5) 
void driveToCrackCenter(float cx, float cy) {
  float distance = distanceToCrackCenter(cx, cy);
  float angle = angleToCrackCenter(cx, cy);

  // Rotate to face the crack center
  rotateDegreesWithoutEncoders(angle, turnSpeed);

  // Drive forward to the crack center
  driveDistanceWithoutEncoders(distance, movementSpeed);
}

// MARK: Setup

void setup() {

  Serial.begin(115200);

  // Set all control pins to outputs

  //  Left
  pinMode(PWML, OUTPUT);
  pinMode(L1, OUTPUT);
  pinMode(L2, OUTPUT);
  //  Right
  pinMode(PWMR, OUTPUT);
  pinMode(R1, OUTPUT);
  pinMode(R2, OUTPUT);

      if(!imu.begin()){
        Serial.print("IMU not found");
    }

    imu.setAccelerometerRange(MPU6050_RANGE_2_G);
    imu.setGyroRange(MPU6050_RANGE_2000_DEG);

  // Set encoder pins to interrupts
  attachInterrupt(digitalPinToInterrupt(ENCAFL), updateEncoderLeft, RISING);

  attachInterrupt(digitalPinToInterrupt(ENCAFR), updateEncoderRight, RISING);
  
  pidController.Init(kP, kI, kD);
  velPIDController.Init(kP, kI, kD);
  // Turn off motors initially
  stopAllMotors();
}

// MARK: Loop

void loop() {
  // Serial.println(encoderValueLeft + " hello " + encoderValueRight);

  // Serial.print(String(encoderValueLeft));
  // Serial.print(", ");
  // Serial.println(String(encoderValueRight));

  updateEncoderLeft();
  updateEncoderRight();
  

  // Serial.print(String(digitalRead(ENCAFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCBFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCAFL)));
  // Serial.print(", ");
  // Serial.println(String(digitalRead(ENCBFL)));


    // if (BS.available() > 0) {
    // char dataFromPi = BS.read();
    //    switch(dataFromPi) {
    //   case 'w':
    //     forwards();
    //     BS.print('w');
    //     break;
    //   case 's':
    //     backwards();
    //     BS.print('s');
    //     break;
    //   case 'a':
    //     left();
    //     BS.print('a');
    //     break;
    //   case 'd':
    //     right();
    //     BS.print('d');
    //     break;
    //   case ' ':
    //     stopAllMotors();
    //     BS.print("Stop");
    //     break;

    //   case '+':
    //     powerValue += 100;
    //     BS.println(powerValue);
    //     break;
    //   case '-':
    //     powerValue -= 100;
    //     BS.println(powerValue);
    //     break;
    //   case 'k':
    //     powerValue = 0;
    //     BS.println(powerValue);
    //     break;
    //   default:
    //     BS.println("Unknown command received: " + dataFromPi);
    //     break;
    // }
    // int pwmVal = map(powerValue,0, 1023, 1100, 1900); // translate POT values to ESC value.
    // float percentVal = ((pwmVal - 1100) / 8);
    // servo.writeMicroseconds(pwmVal);
    // }

    // sensors_event_t accel, gyro, temp;
    // imu.getEvent(&accel, &gyro, &temp);

    // accelX = accel.acceleration.x - 0.4;
    // accelY = accel.acceleration.y + 0.1;
    // accelZ = accel.acceleration.z - 0.84;

    // Serial.print("Accel X:");
    // Serial.print(accelX);
    // Serial.print(", Y:");
    // Serial.print(accelY);
    // Serial.print(", Z:");
    // Serial.print(accelZ);
    // Serial.print("m/s^2 ");

    setSpeedLeft(1000);
    setSpeedRight(1000);

    delay(1000);

    Serial.print(getEncoderSpeedLeft()+",");
    Serial.println(getEncoderSpeedRight());

    previousEncoderPosLeft = encoderValueLeft;
    previousEncoderPosRight = encoderValueRight;
  }


// MARK: Movement Functions

void forwards() {
  setPower(movementSpeed, movementSpeed);
}

void backwards() {
  setPower(-movementSpeed, -movementSpeed);
}

void left() {
  setPower(-movementSpeed, movementSpeed);
}

void right() {
  setPower(movementSpeed, -movementSpeed);
}

int getEncoderSpeedLeft(){
  int speed = encoderValueLeft - previousEncoderPosLeft;
  return speed;
}

int getEncoderSpeedRight(){
  int speed = encoderValueRight - previousEncoderPosRight;
  return speed;
}

void tractionControlLeft(){
  if(!((pow(accelX,2)+pow(accelZ, 2))-pow(9.81, 2) > 0.1) && (getEncoderSpeedLeft() > 1)){
    setPowerLeft(leftPower - 1);
  }
}


//In encoder ticks/sec
void setSpeedLeft(int speed){
  int power = int((speed + 140)/10.2);
  setPowerLeft(power);
}

void setSpeedRight(int speed){
  int power = int((speed + 136)/9.9);
  setPowerRight(power);
}

void tractionControlRight(){

}

void stopLeftMotors() {
  digitalWrite(L1, LOW);
  digitalWrite(L2, LOW);
  digitalWrite(PWML, 0);
}

void stopRightMotors() {
  digitalWrite(R1, LOW);
  digitalWrite(R2, LOW);
  digitalWrite(PWMR, 0);
}

void stopAllMotors() {
  stopLeftMotors();
  stopRightMotors();
}

void LeftMotorsForwards() {
  digitalWrite(L1, HIGH);
  digitalWrite(L2, LOW);
}

void RightMotorsForwards() {
  digitalWrite(R1, HIGH);
  digitalWrite(R2, LOW);
}

void LeftMotorsBackwards() {
  digitalWrite(L1, LOW);
  digitalWrite(L2, HIGH);
}

void RightMotorsBackwards() {
  digitalWrite(R1, LOW);
  digitalWrite(R2, HIGH);
}

void setPower(int left, int right){
  if (left == 0) {
    stopLeftMotors();
  } else if (left < 0) {
    LeftMotorsBackwards();
    left = -left;
  } else {
    LeftMotorsForwards();
  }

  if (right == 0) {
    stopRightMotors();
  } else if (right < 0) {
    RightMotorsBackwards();
    right = -right;
  } else {
    RightMotorsForwards();
  }
  analogWrite(PWML, left);
  analogWrite(PWMR, right);
}

void setPowerLeft(int left){
  leftPower = left;
  if (left == 0) {
    stopLeftMotors();
  } else if (left < 0) {
    LeftMotorsBackwards();
    left = -left;
  } else {
    LeftMotorsForwards();
  }
  analogWrite(PWML, left);
}

void setPowerRight(int right){
  rightPower = right;

  if (right == 0) {
    stopRightMotors();
  } else if (right < 0) {
    RightMotorsBackwards();
    right = -right;
  } else {
    RightMotorsForwards();
  }
  analogWrite(PWMR, right);
}

// MARK: Encoder Functions

void updateEncoderLeft(){
  if (digitalRead(ENCAFL) > digitalRead(ENCBFL))
    encoderValueLeft++;
  else
    encoderValueLeft--;
}

void updateEncoderRight(){
  if (digitalRead(ENCAFR) > digitalRead(ENCBFR))
    encoderValueRight++;
  else
    encoderValueRight--;
}

// MARK: PID Functions

void setMotorPositionLeft(int targetPos) {
    int error = targetPos - encoderValueLeft;
    targetPositionLeft = targetPos;

    pidController.UpdateError(error);

    analogWrite(PWML, pidController.p_error*kP + pidController.i_error*kI + pidController.d_error*kD);    
}

bool isAtTargetPositionLeft() {
    return abs(targetPositionLeft - encoderValueLeft) < 2;
}

void setMotorPositionRight(int targetPos) {
    int error = targetPos - encoderValueRight;
    targetPositionRight = targetPos;

    pidController.UpdateError(error);

    analogWrite(PWMR, pidController.p_error*kP + pidController.i_error*kI + pidController.d_error*kD);    
}

bool isAtTargetPositionRight() {
    return abs(targetPositionRight - encoderValueRight) < 2;
}